{
  "sushi": ["salmon", "arroz", "sushi", "sashimi", "sal", "verdura", "tofu", "pescado", "salada", "marisco", "vinagre_arroz"],
  "alioli": ["aceite", "aceite_oliva", "ajo", "alioli", "salsa"],
  "bibimbap": ["arroz", "carne", "huevo", "zanahoria", "gochujang", "sojo"],
  "cordero_especificar": ["cordero"],
  "costilla_cordero": 1,
  "cordero_costilla_crudo": ["costilla_cordero", "cordero", "costilla"],
  "venir_blanco": ["vino", "blanco"],
  "venir_tinto": ["vino", "tinto"],
  "venir_rosado": ["vino", "rosado"],
  "vinagre_venir": ["vinagre", "vino", "vinagre_vino"],
  "boqueron_frito": ["boqueron", "frito", "pescadito_frito"],
  "cava": ["cava"],
  "plancha": 1,
  "vaca_buey_solomillo_plancha": [
      "buey",
      "solomillo",
      "vaca",
      "carne",
      "filete",
      "plancha"
  ],
  "huevo_gallina_yema_crudo": [
      "yema",
      "gallina",
      "huevo"
  ],
  "pollo_pechuga_plancha": [
      "pechuga",
      "pollo",
      "plancha"
  ],
  "menestro": [
    "verdura",
    "jamon",
    "huevo",
    "menestro"
  ],
  "variado_verdura_legumbr": [
    "legumbre",
    "verdura"
  ],
  "menestro_verdura_congelado": [
      "congelado",
      "menestro",
      "verdura"
  ],
  "huevo_duro_relleno_gratinado": [
    "atun",
    "huevo",
    "duro",
    "huevo_duro",
    "queso",
    "tomate"
  ],
  "sandwich_vegetal_huevo_atun": [
    "lechuga",
    "sandwich",
    "tomate",
    "huevo",
    "huevo_cocido",
    "duro",
    "atun"
  ],
  "ensalada_mixto_huevo_atun": [
    "aceituna",
    "atun",
    "ensalada",
    "huevo",
    "cocido",
    "huevo_cocido",
    "lechuga",
    "tomate"
  ],
  "menestro_vegetarian": [
    "verdura",
    "menestro"
  ],
  "guacamole": [
    "aguacate",
    "pimiento"
  ],
  "escalivar": [
    "cebolla",
    "berenjena",
    "pimiento",
    "esgarraet",
    "asado",
    "pimiento_asado"
  ],
  "esgarraet": [
    "esgarraet",
    "asado",
    "bacalao",
    "pimiento",
    "pimiento_asado"
  ],
  "empanadilla": [
     "carne",
     "empanadilla",
     "atun",
     "pisto"
  ],
  "pescado_frito": ["pescado", "frito"],
  "leche_materno": ["never", "ever", "you", "should", "appear", "except", "for", "exact", "match"],
  "leche_vaca": ["leche", "vaca"],
  "leche_vaca_entero": [
      "entero",
      "leche"
  ],
  "leche_desnatado_pasteurizado": [
      "desnatado",
      "leche"
  ],
  "leche_semidesnatado_pasteurizado": [
      "semidesnatado",
      "leche"
  ],
  "pan_blanco_barra": [
      "pan",
      "pan_blanco"
  ],
  "bocadillo": [
      "bocadillo"
  ],
  "granada": [
      "granada"
  ],
  "bebida_avena": ["leche", "bebida", "avena", "soja"],
  "manzana": ["manzana", "fruta"],
  "arroz_horno": ["arroz", "horno", "garbanzos", "morcilla", "patata", "longaniza", "tomate", "caldo"],
  "mousse_chocolate": 1,
  "curar": ["croissant"],
  "te_infusion_leche": ["te", "leche"],
  "solanum_tuberosum_pobre": ["patata", "frita"],
  "papa_arruga": ["patata", "papa_arruga", "arruga"],
  "papa_arruga_mojo_picon": ["patata", "arruga", "mojo", "pico"],
  "queso_asado_mojo_picon": ["queso", "asado", "mojo", "pico"],
  "tostada_tomate_aceite_oliva": ["aceite", "tomate", "tostada"],
  "tostada_aguacate_granada": ["tostada", "aguacate", "granada", "aceite"],
  "tostada_aguacate_lechugo_queso_fresco": ["tostada", "aguacate", "lechugo", "queso", "aceite"],
  "tostada_aguacate_queso_anchoa": ["tostada", "aguacate", "queso", "anchoa", "aceite"],
  "tostada_aguacate_tomate_salmon": ["tostada", "aguacate", "tomate", "salmon", "aceite"],
  "tostada_mantequila_cacahuete_naranja_canela": ["tostada", "mantequila", "cacahuete", "naranja", "canela"],
  "cafe": ["cafe", "cafe_infusion", "infusion"],
  "cafe_chocolate": ["cafe", "cafe_infusion", "chocolate"],
  "wok_verdura_tempeh_curry": ["wok", "curry", "verdura"],
  "pimiento_morron_conservar": ["pimiento"],
  "pimiento_rojo_crudo": ["pimiento"],
  "garbanzo_brecol_parmesano": ["brecol", "garbanzo", "parmesano"],
  "estofado_pavo_verdura": ["estofado", "verdura", "pavo"],
  "lenteja_verdura": ["lenteja", "verdura"],
  "lenteja_estofada_verdura_arroz_integral": ["lenteja", "verdura", "estofado", "arroz", "arroz_integral"],
  "berenjena_relleno_verdura": ["berenjena", "berenjena_relleno", "verdura"],
  "pobre": 1,
  "macarron_bolonesa": [
      "carne",
      "cebolla",
      "frito",
      "leche",
      "bolones",
      "macarron",
      "macarron_bolonesa"
  ],
  "macarron_chorizo_queso_gratinado": [
      "macarron",
      "cebolla",
      "chorizo",
      "queso",
      "tomate"
  ],
  "macarron_tomate_atun": [
    "atun",
    "macarron",
    "tomate"
  ],
  "macarron_legumbre_verdura": [
    "legumbre",
    "macarron",
    "verdura"
  ],
  "patata": ["papa"],
  "aceite": 293,
  "aceituna": 18,
  "acelga": 11,
  "achicoria": 1,
  "achicorio": 1,
  "actimel": 2,
  "adornar": 2,
  "agridulce": 2,
  "agua": 54,
  "aguacate": 35,
  "aguacates": 2,
  "aguardiente": 2,
  "ahumada": 2,
  "ahumado": 14,
  "ajetes": 2,
  "ajo": 103,
  "ajoblanco": 2,
  "ajos": 10,
  "ala": 2,
  "albahaca": 9,
  "albahacamente": 4,
  "albaricoque": 11,
  "alberto": 2,
  "albondigas": 2,
  "albondigas": 6,
  "albondigon": 2,
  "albufera": 1,
  "alcachofa": 9,
  "alcachofas": 6,
  "alcaparra": 3,
  "alcohol": 6,
  "algodon": 2,
  "alicante": 2,
  "alimentario": 1,
  "alimenticia": 14,
  "alimenticio": 1,
  "alino": 2,
  "aliva": 2,
  "all": 2,
  "almeja": 8,
  "almendra": 10,
  "almendras": 1,
  "almendro": 25,
  "almibar": 8,
  "almidon": 6,
  "almoixàvena": 2,
  "altramuz": 2,
  "alubia": 29,
  "amarillo": 2,
  "amb": 2,
  "anacardo": 2,
  "ancho": 1,
  "anchoa": 5,
  "anguila": 9,
  "angula": 2,
  "anis": 7,
  "aove": 1,
  "aperitivo": 1,
  "aperitivos": 1,
  "apio": 5,
  "apricot": 2,
  "aracena": 2,
  "arandano": 2,
  "arborio": 1,
  "arenque": 4,
  "aromatico": 1,
  "aromatizado": 4,
  "arròs": 3,
  "arroz": 64,
  "arruga": 2,
  "sin_alcohol": 2,
  "arzua": 2,
  "asada": 14,
  "asado": 37,
  "asados": 4,
  "asar": 1,
  "atun": 2,
  "atun": 48,
  "avellana": 2,
  "avellano": 5,
  "avena": 27,
  "avestruz": 2,
  "azafran": 19,
  "azucar": 1,
  "azucar": 40,
  "azucarado": 18,
  "azul": 2,
  "babilla": 1,
  "babys": 3,
  "bacaladilla": 2,
  "bacalao": 37,
  "bacon": 2,
  "bacon": 3,
  "baguette": 2,
  "baja": 16,
  "balsamico": 2,
  "bambu": 2,
  "banda": 2,
  "bandeja": 1,
  "barbacoa": 2,
  "barquillo": 2,
  "barra": 3,
  "barrar": 7,
  "barrita": 8,
  "base": 29,
  "batata": 8,
  "batido": 6,
  "batidos": 1,
  "batir": 7,
  "bebida": 8,
  "bechamel": 5,
  "bellota": 2,
  "beluga": 1,
  "benedictine": 2,
  "berberechos": 4,
  "berenjena": 4,
  "berenjenamente": 10,
  "berenjeno": 5,
  "berro": 2,
  "berros": 6,
  "besugo": 2,
  "bicarbonato": 2,
  "bienmesabe": 2,
  "bifidobacterium": 2,
  "bigaro": 2,
  "bizcocho": 3,
  "bizcochos": 2,
  "blanco": 97,
  "blanquet": 1,
  "bocanegra": 2,
  "bogavante": 4,
  "bola": 2,
  "boletus": 1,
  "bolita": 2,
  "bolleria": 1,
  "bolones": 6,
  "bolsa": 1,
  "bomba": 4,
  "bombon": 2,
  "bonatio": 1,
  "boniato": 6,
  "bonito": 13,
  "boqueron": 4,
  "borraja": 5,
  "borreta": 2,
  "bosque": 6,
  "bote": 3,
  "bounty": 2,
  "brandy": 2,
  "brava": 2,
  "breca": 2,
  "brecol": 8,
  "breva": 2,
  "brie": 2,
  "brizard": 2,
  "brocoli": 2,
  "brocoli": 5,
  "brusela": 4,
  "bruselas": 1,
  "bubango": 1,
  "buey": 2,
  "bulgaro": 2,
  "burgos": 3,
  "butifarra": 2,
  "caballa": 3,
  "caballo": 3,
  "cabeza": 8,
  "cabezas": 1,
  "cabra": 22,
  "cabracho": 3,
  "cabral": 2,
  "cabrito": 5,
  "cacahuete": 19,
  "cacao": 9,
  "cadiz": 2,
  "cafeina": 4,
  "calabacin": 26,
  "calabacin": 6,
  "calabaza": 27,
  "calamar": 19,
  "caldo": 29,
  "caldoso": 2,
  "callo": 2,
  "calorio": 30,
  "camaron": 2,
  "camembert": 4,
  "campera": 2,
  "canario": 15,
  "canela": 29,
  "canelon": 3,
  "cangrejo": 6,
  "canonigo": 2,
  "cantabria": 2,
  "cantidad": 1,
  "caqui": 2,
  "caracol": 2,
  "caramelo": 4,
  "carbonara": 6,
  "cardo": 6,
  "carnaval": 2,
  "carne": 24,
  "carpa": 4,
  "casa": 1,
  "casar": 2,
  "cascara": 1,
  "cascaro": 11,
  "casera": 5,
  "casin": 2,
  "castana": 4,
  "castellano": 2,
  "catalan": 2,
  "categoria": 2,
  "cava": 2,
  "caviar": 2,
  "cayena": 2,
  "cazon": 3,
  "cda": 2,
  "cebada": 7,
  "cebo": 2,
  "cebolla": 107,
  "cebolleta": 8,
  "cebolleto": 1,
  "cebollino": 2,
  "cebollitamente": 1,
  "cebreiro": 2,
  "cecina": 1,
  "cecino": 1,
  "centeno": 6,
  "centollo": 2,
  "central": 1,
  "cerdo": 46,
  "cereal": 35,
  "cereales": 17,
  "cereza": 4,
  "cerveza": 10,
  "chalota": 1,
  "champinon": 2,
  "champinon": 33,
  "chayote": 2,
  "cheddar": 2,
  "cherne": 5,
  "cherry": 6,
  "chia": 2,
  "chia": 2,
  "chicharro": 5,
  "chicle": 2,
  "chile": 4,
  "chip": 5,
  "chipiron": 2,
  "chir": 1,
  "chirimoya": 2,
  "chirla": 1,
  "chistorra": 2,
  "chocolate": 61,
  "chocolateado": 2,
  "choped": 2,
  "choricero": 2,
  "chorizo": 16,
  "chorrito": 5,
  "chufa": 4,
  "chufo": 1,
  "chuleta": 3,
  "chuletas": 2,
  "chuletita": 3,
  "chupito": 1,
  "churro": 4,
  "ciervo": 2,
  "cigala": 2,
  "cilantro": 5,
  "ciruela": 16,
  "cl": 1,
  "claro": 6,
  "clavo": 2,
  "cm": 1,
  "coca": 4,
  "cochino": 3,
  "cocida": 4,
  "cocido": 24,
  "cocina": 1,
  "cocinado": 1,
  "cocinar": 9,
  "coco": 19,
  "codorniz": 2,
  "cogollo": 1,
  "col": 16,
  "cola": 8,
  "coliflor": 16,
  "colinabo": 1,
  "colmada": 1,
  "colo": 1,
  "color": 1,
  "colorante": 3,
  "colza": 2,
  "comino": 18,
  "complejo": 2,
  "compuesto": 2,
  "conac": 2,
  "concentrado": 2,
  "condensadamonsado": 6,
  "conejo": 16,
  "confitado": 5,
  "confitura": 2,
  "congelada": 20,
  "congelado": 17,
  "congrio": 2,
  "conservar": 52,
  "contramuslo": 1,
  "cookie": 2,
  "copa": 1,
  "copita": 1,
  "copo": 11,
  "corazon": 10,
  "corazon": 2,
  "cordero": 21,
  "corinto": 1,
  "cortado": 11,
  "cortar": 9,
  "corteza": 4,
  "costilla": 9,
  "costro": 2,
  "couscou": 1,
  "crema": 40,
  "cremoso": 2,
  "croissant": 4,
  "croqueta": 8,
  "cruda": 157,
  "crudo": 164,
  "cuadro": 1,
  "cuajada": 2,
  "cuarto": 1,
  "cubano": 2,
  "cubata": 2,
  "cubierta": 2,
  "cubierto": 2,
  "cubito": 2,
  "cuchara": 1,
  "cucharada": 185,
  "cucharadilla": 2,
  "cucharadita": 64,
  "cucharadsas": 1,
  "cucharita": 1,
  "cuharada": 2,
  "curacao": 2,
  "curado": 4,
  "curcuma": 6,
  "curry": 19,
  "cuscus": 5,
  "daditos": 3,
  "datil": 2,
  "debil": 2,
  "decorar": 3,
  "delicia": 2,
  "desalado": 2,
  "desayuno": 32,
  "descafeinado": 4,
  "descongelad": 1,
  "desecada": 2,
  "desecado": 7,
  "desgranadas": 1,
  "deshidratadas": 1,
  "deshuesado": 1,
  "desmenuzado": 1,
  "desnatada": 4,
  "desnatado": 42,
  "diente": 84,
  "dientes": 1,
  "dietes": 1,
  "digestiva": 4,
  "dijon": 2,
  "doble": 1,
  "donut": 4,
  "dorada": 4,
  "dorado": 6,
  "dulce": 21,
  "duro": 11,
  "ecologicameno": 2,
  "economico": 2,
  "edam": 2,
  "eino": 2,
  "ejemplo": 2,
  "eko": 2,
  "el": 1,
  "embotellada": 2,
  "embuchado": 2,
  "embutido": 1,
  "emmental": 3,
  "empanada": 4,
  "empanado": 2,
  "emperador": 2,
  "encebollado": 4,
  "endibia": 2,
  "eneldo": 4,
  "energetico": 2,
  "engrasar": 1,
  "enlatado": 20,
  "enriquecido": 12,
  "ensaimada": 2,
  "ensalada": 46,
  "ensaladilla": 2,
  "entero": 54,
  "envasado": 16,
  "escabeche": 6,
  "escaldado": 2,
  "escaldon": 2,
  "escalfado": 2,
  "escalfados": 2,
  "escarola": 2,
  "escurrido": 5,
  "escurridomescesc": 4,
  "esencia": 1,
  "espada": 4,
  "espagueti": 2,
  "espaguetis": 15,
  "esparrago": 13,
  "esparrago": 4,
  "especia": 1,
  "especificar": 8,
  "espinaca": 27,
  "espinacamente": 4,
  "espinacar": 3,
  "espiral": 2,
  "espolvorear": 3,
  "esqueixada": 1,
  "esqueixado": 1,
  "estilo": 1,
  "estofado": 17,
  "estofar": 1,
  "estrellar": 1,
  "exotico": 2,
  "extra": 69,
  "extragraso": 2,
  "fabada": 2,
  "fajita": 1,
  "fajitas": 1,
  "faneca": 2,
  "fartons": 2,
  "fermentado": 4,
  "ferrauro": 1,
  "fesols": 2,
  "feta": 4,
  "fetuccini": 1,
  "fiambre": 9,
  "fibra": 8,
  "fideo": 3,
  "fideua": 4,
  "filete": 11,
  "finamente": 2,
  "fino": 17,
  "flamenquin": 2,
  "flan": 4,
  "fletan": 2,
  "flor": 2,
  "florete": 1,
  "foie": 2,
  "frambuesa": 8,
  "frances": 12,
  "frangollo": 2,
  "frankfurt": 2,
  "freir": 3,
  "fresa": 31,
  "fresce": 30,
  "fresco": 78,
  "frio": 5,
  "frita": 31,
  "frito": 27,
  "frittata": 4,
  "fructosa": 2,
  "fruta": 49,
  "fruto": 3,
  "frutos": 1,
  "fuerza": 3,
  "fuet": 2,
  "fumet": 1,
  "fundido": 2,
  "fundir": 1,
  "gajos": 2,
  "gallego": 2,
  "galleta": 16,
  "galleto": 6,
  "gallina": 20,
  "gallo": 2,
  "gamba": 6,
  "gambas": 20,
  "gambones": 3,
  "garbanzo": 9,
  "garbanzos": 25,
  "garrofo": 1,
  "gas": 12,
  "gaseosa": 2,
  "gaseosas": 1,
  "gasificante": 1,
  "gazpacho": 2,
  "gaztazarra": 2,
  "gelatina": 2,
  "generica": 2,
  "generico": 14,
  "genero": 1,
  "generoso": 1,
  "germen": 4,
  "germinada": 2,
  "ginebra": 2,
  "girasol": 17,
  "glas": 1,
  "glo": 2,
  "gofio": 16,
  "gomasio": 2,
  "gominola": 2,
  "gordo": 3,
  "gotita": 1,
  "gouda": 2,
  "gr": 5,
  "gramo": 52,
  "granja": 2,
  "granny": 1,
  "grano": 6,
  "granulado": 1,
  "gras": 2,
  "grasa": 26,
  "gratinado": 4,
  "grazalema": 2,
  "grelo": 2,
  "griega": 2,
  "griego": 2,
  "grifo": 1,
  "grosella": 12,
  "grosor": 1,
  "grueso": 4,
  "gruyer": 2,
  "guayaba": 4,
  "guia": 2,
  "guindilla": 7,
  "guindillas": 5,
  "guisado": 2,
  "guisante": 6,
  "guisantes": 15,
  "guisar": 2,
  "guiso": 3,
  "gusanito": 2,
  "gusto": 31,
  "haba": 11,
  "habas": 4,
  "hamburguesa": 7,
  "hamburguesas": 3,
  "harina": 54,
  "hebra": 1,
  "hebras": 6,
  "helado": 6,
  "heliz": 1,
  "herreno": 2,
  "hervida": 36,
  "hervidas": 2,
  "hervido": 20,
  "hidratar": 1,
  "hierba": 13,
  "hierbabuena": 2,
  "higadillo": 1,
  "higado": 4,
  "higado": 6,
  "higo": 4,
  "higos": 1,
  "hinchado": 2,
  "hinojo": 2,
  "hoja": 20,
  "hojaldre": 4,
  "hojas": 3,
  "hojita": 1,
  "hora": 1,
  "horchata": 4,
  "hornear": 1,
  "hornezada": 2,
  "horno": 33,
  "huerto": 1,
  "hueso": 2,
  "huevo": 116,
  "huevos": 9,
  "hummus": 2,
  "iberico": 6,
  "ibor": 2,
  "igual": 1,
  "infusion": 8,
  "ingles": 2,
  "ingredientes": 3,
  "integral": 80,
  "isabel": 2,
  "isotonico": 2,
  "italiano": 2,
  "jacobo": 2,
  "jalea": 4,
  "jamon": 2,
  "jamon": 38,
  "jengibre": 13,
  "jerez": 5,
  "judia": 1,
  "judia": 15,
  "judias": 1,
  "judias": 2,
  "judio": 2,
  "judio": 5,
  "jugo": 6,
  "jurel": 2,
  "kala": 1,
  "kebab": 1,
  "keber": 1,
  "kefir": 2,
  "ketchup": 3,
  "kg": 44,
  "kilo": 8,
  "kiwi": 5,
  "lacon": 2,
  "lacteo": 6,
  "lactosa": 1,
  "lactoso": 1,
  "lamina": 3,
  "langosta": 2,
  "langostino": 4,
  "lapa": 2,
  "lasana": 8,
  "lata": 18,
  "laurel": 18,
  "leche": 69,
  "lechuga": 2,
  "lechugo": 12,
  "lecitina": 2,
  "legumbre": 5,
  "lengua": 8,
  "lenguado": 14,
  "lenteja": 24,
  "lentejas": 4,
  "lentejo": 15,
  "levadura": 8,
  "licor": 13,
  "liebre": 2,
  "light": 2,
  "lija": 1,
  "lijo": 1,
  "lima": 5,
  "limon": 54,
  "limonada": 2,
  "limpio": 4,
  "lino": 6,
  "liquido": 30,
  "litchi": 2,
  "litro": 14,
  "llanda": 2,
  "lombarda": 8,
  "lomo": 14,
  "loncho": 4,
  "longaniza": 4,
  "lubina": 3,
  "lubino": 2,
  "lucio": 2,
  "macadamia": 2,
  "macarron": 15,
  "macedonia": 1,
  "macedonio": 1,
  "machacados": 1,
  "machanga": 2,
  "maduro": 9,
  "maduros": 8,
  "magdalena": 2,
  "magra": 1,
  "magrets": 1,
  "magro": 2,
  "mahon": 2,
  "maicena": 1,
  "maiz": 2,
  "maiz": 34,
  "majado": 1,
  "majorero": 2,
  "mancha": 4,
  "manchego": 4,
  "mandarina": 4,
  "mango": 9,
  "manita": 1,
  "manojito": 1,
  "manojo": 4,
  "manteca": 3,
  "mantequila": 2,
  "mantequilla": 31,
  "mar": 2,
  "maracuya": 4,
  "maravilla": 2,
  "margarina": 2,
  "margarino": 2,
  "marie": 2,
  "marina": 2,
  "marinado": 4,
  "marinados": 4,
  "marinar": 2,
  "marinero": 4,
  "mario": 2,
  "marisco": 2,
  "mars": 2,
  "masa": 10,
  "matalahuga": 1,
  "materna": 2,
  "mayonesa": 4,
  "mayonesa": 8,
  "mazorca": 1,
  "mazorco": 5,
  "media": 6,
  "mediano": 27,
  "medida": 1,
  "medio": 1,
  "mejillon": 11,
  "mejillon": 2,
  "mejillones": 1,
  "mejorana": 1,
  "melocoton": 19,
  "melon": 2,
  "membrillo": 2,
  "menta": 4,
  "merengadamente": 2,
  "merluza": 24,
  "mermelada": 9,
  "mermelado": 9,
  "mero": 8,
  "mezcla": 4,
  "miel": 15,
  "migas": 2,
  "migo": 3,
  "mijo": 5,
  "mililitro": 6,
  "millan": 2,
  "millo": 5,
  "mineral": 2,
  "mineralizacion": 2,
  "miso": 2,
  "mitad": 1,
  "mixto": 2,
  "ml": 96,
  "mojar": 2,
  "mojo": 15,
  "mol": 2,
  "molde": 8,
  "molia": 1,
  "molida": 27,
  "molido": 16,
  "molina": 1,
  "molleja": 2,
  "monjavino": 2,
  "montada": 2,
  "montaneta": 2,
  "montar": 1,
  "mora": 2,
  "morada": 1,
  "moras": 3,
  "morcilla": 8,
  "morcillas": 1,
  "moreno": 3,
  "morro": 1,
  "morron": 1,
  "morron": 4,
  "mortadela": 2,
  "moscada": 7,
  "mostaza": 9,
  "mousse": 17,
  "moya": 4,
  "mozzarela": 1,
  "mozzarella": 6,
  "muesli": 4,
  "mujol": 4,
  "munster": 2,
  "murcio": 2,
  "muslo": 9,
  "nabo": 2,
  "nabos": 1,
  "namak": 1,
  "napolitana": 3,
  "napolitano": 1,
  "naps": 2,
  "naranja": 28,
  "naranjo": 1,
  "nata": 17,
  "natilla": 1,
  "natillas": 1,
  "natural": 35,
  "navarro": 2,
  "necora": 2,
  "nectar": 20,
  "nectarino": 2,
  "negro": 63,
  "niscalo": 2,
  "nispero": 2,
  "nispero": 4,
  "nizarda": 2,
  "nº": 1,
  "nocilla": 1,
  "noras": 1,
  "normal": 2,
  "norte": 4,
  "nuez": 24,
  "obleo": 1,
  "oca": 1,
  "oco": 1,
  "oliva": 202,
  "omega": 2,
  "opcional": 14,
  "oporto": 2,
  "oregano": 1,
  "oregano": 18,
  "orejon": 1,
  "oscuro": 2,
  "ostra": 2,
  "oveja": 8,
  "paella": 3,
  "paello": 3,
  "pais": 2,
  "palito": 1,
  "palma": 3,
  "palmera": 6,
  "palmero": 1,
  "palmito": 2,
  "palo": 3,
  "palometa": 1,
  "palometar": 1,
  "palomita": 1,
  "palomitas": 1,
  "pan": 95,
  "panaderas": 2,
  "panaderia": 2,
  "panceta": 8,
  "panga": 2,
  "panquemao": 2,
  "papa": 1,
  "papas": 8,
  "papaya": 2,
  "papillote": 8,
  "paquetito": 2,
  "paraguaya": 2,
  "pardina": 2,
  "parmesano": 13,
  "parrilla": 4,
  "parte": 1,
  "partida": 1,
  "pasa": 13,
  "pasar": 2,
  "pasiego": 2,
  "pasta": 31,
  "pastas": 1,
  "pastel": 11,
  "pastelero": 2,
  "pasteurizadamente": 4,
  "pastilla": 3,
  "pasto": 1,
  "pata": 2,
  "patata": 64,
  "pate": 2,
  "pate": 2,
  "pato": 12,
  "pavo": 21,
  "pebre": 2,
  "pechuga": 21,
  "pechugo": 4,
  "pecorino": 1,
  "pedroche": 2,
  "pelada": 5,
  "pelado": 9,
  "pella": 2,
  "pellizco": 2,
  "pello": 1,
  "penamellera": 2,
  "pencas": 2,
  "pepinillo": 2,
  "pepino": 10,
  "pepita": 1,
  "pequeno": 37,
  "pera": 13,
  "perca": 4,
  "percebe": 2,
  "perdiz": 2,
  "perejil": 59,
  "perlado": 1,
  "pescadilla": 4,
  "pescado": 23,
  "pesto": ["queso", "parmesano", "albahaca", "pinon"],
  "petit": 10,
  "pez": 4,
  "picada": 15,
  "picadas": 3,
  "picado": 18,
  "picados": 5,
  "picante": 7,
  "pichon": 2,
  "picon": 11,
  "picon": 2,
  "picona": 6,
  "piel": 38,
  "pierna": 4,
  "pieza": 1,
  "pijota": 2,
  "pil": 4,
  "pimenton": 38,
  "pimienta": 97,
  "pimiento": 58,
  "pimieta": 1,
  "pina": ["pina", "fruta"],
  "pinon": 18,
  "pinon": 2,
  "pinta": 2,
  "pintar": 1,
  "pipa": 2,
  "pipas": 3,
  "pipo": 4,
  "pistacho": 5,
  "pisto": 4,
  "pitu": 2,
  "pizca": 28,
  "pizco": 1,
  "pizza": 1,
  "pizzo": 5,
  "placa": 1,
  "plancho": 39,
  "plano": 1,
  "platano": 17,
  "platija": 4,
  "plato": 2,
  "pocha": 2,
  "pocho": 1,
  "pollo": 80,
  "polvo": 34,
  "pomelo": 8,
  "poquito": 1,
  "porciones": 2,
  "pork": 2,
  "porridge": 6,
  "porrua": 2,
  "portobello": 1,
  "postre": 5,
  "potaje": 4,
  "precocidamente": 1,
  "precocinadamente": 2,
  "preferiblemente": 1,
  "prefrita": 2,
  "preparado": 3,
  "primavera": 2,
  "principe": 2,
  "produccion": 2,
  "proteico": 2,
  "provenzal": 4,
  "puchero": 2,
  "pudding": 2,
  "pudin": 2,
  "puerro": 14,
  "pulmon": 6,
  "pulpa": 2,
  "pulpo": 10,
  "punado": 3,
  "punta": 1,
  "pure": 21,
  "quesadilla": 2,
  "quesillo": 2,
  "queso": 225,
  "quino": 1,
  "quino": 7,
  "quinoa": 3,
  "quisquilla": 2,
  "quitar": 7,
  "rabanada": 1,
  "rabano": 2,
  "rabanos": 3,
  "rabo": 3,
  "raclette": 2,
  "ralladas": 1,
  "rallado": 30,
  "ralladura": 9,
  "rallar": 2,
  "rama": 4,
  "ramas": 1,
  "ramburina": 1,
  "ramita": 4,
  "ramito": 6,
  "rancho": 2,
  "rape": 12,
  "rascacio": 2,
  "raya": 2,
  "real": 2,
  "rebajar": 2,
  "rebanada": 33,
  "rebozada": 4,
  "rebozar": 2,
  "recien": 5,
  "reconstituir": 4,
  "red": 2,
  "redondo": 1,
  "refinado": 1,
  "refresco": 22,
  "refrito": 2,
  "regaliz": 2,
  "rehogada": 2,
  "rehogadas": 4,
  "reinetas": 1,
  "rellena": 4,
  "relleno": 16,
  "remojada": 6,
  "remojado": 2,
  "remojo": 2,
  "remolacha": 2,
  "repollo": 3,
  "requeson": 18,
  "requeson": 2,
  "revolver": 6,
  "revuelto": 2,
  "rico": 2,
  "ricota": 3,
  "rinon": 4,
  "rio": 2,
  "riojano": 2,
  "risotto": 4,
  "rizada": 2,
  "rodaballo": 2,
  "rodaja": 5,
  "rodajita": 1,
  "roget": 1,
  "rojo": 51,
  "rollito": 2,
  "romano": 1,
  "romero": 13,
  "ron": 2,
  "ropa": 2,
  "roquefort": 4,
  "rosa": 1,
  "rosado": 2,
  "rosquilla": 2,
  "royal": 1,
  "rucula": 11,
  "rueda": 1,
  "ruso": 2,
  "sa": 4,
  "sabor": 38,
  "sal": 155,
  "salada": 6,
  "saladas": 2,
  "salado": 11,
  "salami": 2,
  "salazon": 3,
  "salchicha": 5,
  "salchicho": 6,
  "salchichon": 2,
  "salema": 1,
  "salemo": 1,
  "salmon": 23,
  "salmonete": 2,
  "salmorejo": 4,
  "salmuera": 2,
  "salpicon": 2,
  "salsa": 48,
  "salteada": 6,
  "salteado": 2,
  "salvado": 1,
  "salvar": 1,
  "sama": 4,
  "san": 2,
  "sancocho": 2,
  "sandia": 2,
  "sandwich": 3,
  "sandwicha": 3,
  "sangria": 2,
  "sardina": 10,
  "sardino": 4,
  "sargo": 2,
  "secas": 8,
  "seco": 46,
  "seitan": 8,
  "selvatico": 1,
  "semicurado": 2,
  "semidesnatado": 4,
  "semilla": 11,
  "semola": 2,
  "semolo": 2,
  "senderuelo": 1,
  "senia": 1,
  "separable": 12,
  "separada": 1,
  "sepia": 3,
  "sepio": 1,
  "serrano": 15,
  "serrat": 2,
  "servilleta": 2,
  "servir": 1,
  "sesamo": 10,
  "sesos": 3,
  "sesu": 3,
  "seta": 2,
  "seto": 25,
  "shiitake": 1,
  "siciliano": 2,
  "sidra": 2,
  "similar": 1,
  "simon": 2,
  "smith": 1,
  "sobao": 2,
  "sobrasada": 2,
  "sobre": 1,
  "soda": 2,
  "sodico": 1,
  "sofrito": 2,
  "soja": 5,
  "sojo": 25,
  "solomillo": 14,
  "soluble": 6,
  "sopa": 6,
  "sopero": 19,
  "suave": 2,
  "sucedaneo": 2,
  "suïsse": 2,
  "suisse": 6,
  "suplemento": 2,
  "surimi": 2,
  "suspiro": 1,
  "suspiros": 1,
  "tabasco": 2,
  "tabule": 2,
  "tacita": 2,
  "taco": 1,
  "tallo": 2,
  "tamano": 2,
  "tapioca": 2,
  "tarrina": 2,
  "tarta": 6,
  "taza": 12,
  "tazo": 4,
  "te": 6,
  "tejeda": 1,
  "tempeh": 3,
  "templado": 1,
  "temporada": 1,
  "tenca": 2,
  "tenerife": 2,
  "tequila": 2,
  "terna": 1,
  "ternera": 6,
  "ternero": 24,
  "tetilla": 1,
  "tetillar": 1,
  "tibio": 2,
  "tierno": 5,
  "tietar": 2,
  "tinta": 2,
  "tinto": 5,
  "tira": 1,
  "titaina": 2,
  "tocino": 4,
  "tofu": 4,
  "tollo": 9,
  "tomate": 155,
  "tomates": 5,
  "tombet": 2,
  "tomillo": 18,
  "tonica": 2,
  "toro": 2,
  "torta": 1,
  "tortilla": 33,
  "tortita": 2,
  "tortito": 2,
  "torto": 3,
  "tostada": 58,
  "tostadas": 7,
  "tostado": 14,
  "trigo": 51,
  "trigueros": 4,
  "triturado": 15,
  "troceadas": 1,
  "troceado": 9,
  "trocito": 2,
  "tropical": 2,
  "trozo": 7,
  "trucha": 2,
  "trucho": 4,
  "trufa": 2,
  "tupi": 2,
  "turron": 2,
  "unidad": 3,
  "untar": 8,
  "utilizar": 2,
  "uva": 1,
  "uvo": 16,
  "vaca": 11,
  "vainilla": 9,
  "valencia": 1,
  "valenciano": 2,
  "valer": 1,
  "valsequillo": 1,
  "vapor": 4,
  "variadas": 3,
  "variado": 3,
  "variedad": 3,
  "vasito": 2,
  "vaso": 21,
  "vasos": 2,
  "vegano": 14,
  "vegetal": 18,
  "vegetariana": 2,
  "ventresca": 1,
  "vera": 1,
  "verde": 64,
  "verdura": 56,
  "vermut": 2,
  "version": 1,
  "vichyssoise": 2,
  "vieira": 2,
  "vieiras": 1,
  "vieja": 1,
  "viejo": 3,
  "viena": 2,
  "vinagre": 40,
  "vinagreta": 5,
  "vino": 45,
  "virgen": 125,
  "vitaminico": 2,
  "vivo": 1,
  "vodka": 2,
  "vol": 1,
  "volador": 2,
  "whisky": 2,
  "wok": 2,
  "yanahoria": 1,
  "yemas": 3,
  "yemo": 5,
  "yema": 5,
  "yocido": 11,
  "yodada": 2,
  "yogur": 91,
  "yolleria": 1,
  "zamburino": 1,
  "zamorano": 2,
  "zanahoria": 54,
  "zarzuela": 2,
  "zumo": 47
}
